In [1]:
import pandas as pd
import numpy as np

# 排名

In [9]:
ser1 = pd.Series(np.random.randint(1,9,4))
ser1

0    6
1    2
2    4
3    2
dtype: int32

In [10]:
ser1.rank()

0    4.0
1    1.5
2    3.0
3    1.5
dtype: float64

In [12]:
ser1.rank( method='max')

0    4.0
1    2.0
2    3.0
3    2.0
dtype: float64

In [13]:
ser1.rank( method='min')

0    4.0
1    1.0
2    3.0
3    1.0
dtype: float64

In [14]:
ser1.rank( method='first')

0    4.0
1    1.0
2    3.0
3    2.0
dtype: float64

In [16]:
df1 = pd.DataFrame(np.random.randint(1,9,(4,4)))
df1

   0  1  2  3
0  6  1  5  3
1  5  2  8  4
2  1  8  4  6
3  4  3  6  3

In [17]:
df1.rank() #默认按列排

     0    1    2    3
0  4.0  1.0  2.0  1.5
1  3.0  2.0  4.0  3.0
2  1.0  4.0  1.0  4.0
3  2.0  3.0  3.0  1.5

In [18]:
df1.rank(axis = 1)  #设置按行排序

     0    1    2    3
0  4.0  1.0  3.0  2.0
1  3.0  1.0  4.0  2.0
2  1.0  4.0  2.0  3.0
3  3.0  1.5  4.0  1.5

In [19]:
df1.rank(method = 'max')

     0    1    2    3
0  4.0  1.0  2.0  2.0
1  3.0  2.0  4.0  3.0
2  1.0  4.0  1.0  4.0
3  2.0  3.0  3.0  2.0

In [20]:
df1.rank(method = 'min')

     0    1    2    3
0  4.0  1.0  2.0  1.0
1  3.0  2.0  4.0  3.0
2  1.0  4.0  1.0  4.0
3  2.0  3.0  3.0  1.0

In [21]:
df1.rank(method = 'first')

     0    1    2    3
0  4.0  1.0  2.0  1.0
1  3.0  2.0  4.0  3.0
2  1.0  4.0  1.0  4.0
3  2.0  3.0  3.0  2.0

# 排序

In [24]:
#sort_index  按索引排序
ser2 = pd.Series(np.random.randint(1,9,5),index = list('bcdae'))
ser2

b    1
c    7
d    4
a    3
e    1
dtype: int32

In [25]:
ser2.sort_index()

a    3
b    1
c    7
d    4
e    1
dtype: int32

In [26]:
ser2.sort_index(ascending=False)

e    1
d    4
c    7
b    1
a    3
dtype: int32

In [27]:
#DataFrame
df1 = pd.DataFrame(np.random.randint(1,9,(4,4)),index = list('CADB'),columns = list('cbda'))
df1

   c  b  d  a
C  2  8  1  1
A  7  6  8  1
D  8  5  8  4
B  5  1  7  2

In [28]:
df1.sort_index()  #默认按行排序

   c  b  d  a
A  7  6  8  1
B  5  1  7  2
C  2  8  1  1
D  8  5  8  4

In [29]:
df1.sort_index(axis = 1) #设置按列排序

   a  b  c  d
C  1  8  2  1
A  1  6  7  8
D  4  5  8  8
B  2  1  5  7

In [33]:
#按值排序  sort_values()
ser2 = pd.Series(np.random.randint(1,9,5),index = list('abcde'))
ser2

a    4
b    3
c    3
d    7
e    4
dtype: int32

In [34]:
ser2.sort_values()

b    3
c    3
a    4
e    4
d    7
dtype: int32

In [36]:
ser2.sort_values(ascending = False)

d    7
e    4
a    4
c    3
b    3
dtype: int32

In [37]:
df2 = pd.DataFrame(np.random.randint(1,9,(4,4)),index = list('ABCD'),columns = list('abcd'))
df2

   a  b  c  d
A  6  4  8  5
B  7  1  8  6
C  8  6  6  1
D  6  3  6  3

In [41]:
df2.sort_values(by = 'a')
df2.sort_values(by = 'd',ascending = False)

   a  b  c  d
B  7  1  8  6
A  6  4  8  5
D  6  3  6  3
C  8  6  6  1

In [47]:
df2.sort_values(by = 'D',axis = 1,ascending = False)

   a  c  b  d
A  6  8  4  5
B  7  8  1  6
C  8  6  6  1
D  6  6  3  3

# apply

In [50]:
ser3 = pd.Series(np.random.randint(1,9,5),index = list('abcde'))
ser3

a    6
b    2
c    2
d    5
e    1
dtype: int32

In [51]:
ser3.apply(lambda x:x+1)

a    7
b    3
c    3
d    6
e    2
dtype: int64

In [52]:
def f1(x):
    return x*10
ser3.apply(f1)

a    60
b    20
c    20
d    50
e    10
dtype: int64

In [54]:
def f1(x,n):
    return x*n
ser3.apply(f1,args = (3,))   #传递参数

a    18
b     6
c     6
d    15
e     3
dtype: int64

In [62]:
df3 = pd.DataFrame(np.random.randint(1,9,(4,4)),index = list('ABCD'),columns=list('abcd'))
df3

   a  b  c  d
A  5  6  4  6
B  6  4  7  1
C  3  4  7  1
D  8  1  4  6

In [63]:
df3.apply(lambda x:x+1)

   a  b  c  d
A  6  7  5  7
B  7  5  8  2
C  4  5  8  2
D  9  2  5  7

In [64]:
def f2(x):
    return x*10
df3.apply(f2)

    a   b   c   d
A  50  60  40  60
B  60  40  70  10
C  30  40  70  10
D  80  10  40  60

In [73]:
#使用聚合函数
def f3(x):
    return x.sum()
df3.apply(f3)     #默认每列进行累加操作
df3.loc[:,['a','c']].apply(f3)


df3.apply(lambda x:x.sum(),axis = 1)  #设置行累加
df3.loc['A':'B'].apply(f3,axis = 1)

A    21
B    18
dtype: int64

In [75]:
df3.apply(lambda x:x.mean())
df3.loc['A':'B'].apply(lambda x:x.mean(),axis = 1)

A    5.25
B    4.50
dtype: float64

In [76]:
data = np.random.randint(1,10,(4,4))
df4 = pd.DataFrame(data,columns = ['a','b','c','d'])
df4

   a  b  c  d
0  9  6  5  8
1  8  7  8  8
2  8  5  5  1
3  6  3  8  8

In [81]:
def f4(x,n):
    return str(x)+n

df4.loc[:,'a'].apply(f4,args = ('haha',))

0    9haha
1    8haha
2    8haha
3    6haha
Name: a, dtype: object

# 练习

In [98]:
#分别取出年月日保存在dataframe中
import time
df5 = pd.DataFrame(np.random.randn(3,4),columns = list('abcd'))
df5['e'] = pd.date_range('20180112',periods = 3)
df5

          a         b         c         d          e
0 -1.029845 -1.759772 -0.536050  1.145468 2018-01-12
1  0.515797 -0.265441 -0.611111  0.201547 2018-01-13
2 -0.644890  0.924903  1.267778  1.005538 2018-01-14

In [113]:
def f6(x):
    dates = time.strptime(str(x),'%Y-%m-%d %H:%M:%S')
    return pd.Series(dates[0:3])
df5['e'].apply(f6)

      0  1   2
0  2018  1  12
1  2018  1  13
2  2018  1  14